Terraform plan in __Deployment/terraform__
<details>
<summary>Plan: 3 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.app_package will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "app_package"  {
      ~ id                  = "****************************************" -> (known after apply)
      ~ output_base64sha256 = "JE+nKuytBbYFmc+O/pgzJJt02tXWo8dm3NQ4bQEzVPA=" -> (known after apply)
      ~ output_md5          = "4977882905984c41a693d13efa068953" -> (known after apply)
      ~ output_sha          = "2593c3770c71773c3fda7d4b7041ec9b38e17f04" -> (known after apply)
      ~ output_size         = 6035 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_resource_group_template_deployment.icebreaker will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "icebreaker" {
        id                       = "/subscriptions/36fd3843-f200-408f-a432-9bd04c5af9be/resourceGroups/rg-Icebreaker-int-01/providers/Microsoft.Resources/deployments/icebreaker-deployment"
        name                     = "icebreaker-deployment"
      ~ parameters_content       = (sensitive)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ appDomain      = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ appServiceName = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                }
              ~ parameters     = {
                  ~ appDescription      = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ appIconUrl          = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ appName             = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ botAppID            = {
                      ~ type      = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ botAppPassword      = {
                      ~ type      = "SecureString" -> "securestring"
                        # (2 unchanged elements hidden)
                    }
                  ~ location            = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingDayOfWeek    = {
                      ~ type          = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingHour         = {
                      ~ type          = "Int" -> "int"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingStartKey     = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingTimeZone     = {
                      ~ type         = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ pairingWeekInterval = {
                      ~ type         = "Int" -> "int"
                        # (3 unchanged elements hidden)
                    }
                  ~ planSize            = {
                      ~ type          = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ sku                 = {
                      ~ type          = "String" -> "string"
                        # (3 unchanged elements hidden)
                    }
                  ~ tenantId            = {
                      ~ type         = "String" -> "string"
                        # (4 unchanged elements hidden)
                    }
                    # (1 unchanged element hidden)
                }
              ~ resources      = [
                    # (1 unchanged element hidden)
                    {
                        apiVersion = "2016-09-01"
                        location   = "[parameters('location')]"
                        name       = "[variables('appHostingPlanName')]"
                        properties = {
                            hostingEnvironment = ""
                            name               = "[variables('appHostingPlanName')]"
                            numberOfWorkers    = 1
                        }
                        sku        = {
                            capacity = 0
                            family   = "[variables('skuFamily')]"
                            name     = "[variables('skuName')]"
                            size     = "[variables('skuSize')]"
                            tier     = "[parameters('sku')]"
                        }
                        type       = "Microsoft.Web/serverfarms"
                    },
                  ~ {
                      + scale      = null
                        # (8 unchanged elements hidden)
                    },
                  ~ {
                      + scale      = null
                        # (7 unchanged elements hidden)
                    },
                  ~ {
                      + scale      = null
                        # (7 unchanged elements hidden)
                    },
                  ~ {
                      + scale      = null
                        # (8 unchanged elements hidden)
                    },
                    {
                        apiVersion = "2019-09-01"
                        dependsOn  = [
                            "[concat('Microsoft.Web/sites/', variables('appServiceName'))]",
                        ]
                        location   = "[parameters('location')]"
                        name       = "[variables('keyVaultName')]"
                        properties = {
                            accessPolicies               = [
                                {
                                    objectId    = "[reference(resourceId('Microsoft.Web/sites', variables('appServiceName')), '2018-11-01', 'Full').identity.principalId]"
                                    permissions = {
                                        secrets = [
                                            "get",
                                        ]
                                    }
                                    tenantId    = "[subscription().tenantId]"
                                },
                            ]
                            enabledForTemplateDeployment = true
                            sku                          = {
                                family = "A"
                                name   = "Standard"
                            }
                            tenantId                     = "[subscription().tenantId]"
                        }
                        type       = "Microsoft.KeyVault/vaults"
                    },
                    # (3 unchanged elements hidden)
                ]
                # (3 unchanged elements hidden)
            }
        )
        # (5 unchanged attributes hidden)
    }

  # local_file.logo["color.png"] will be created
  + resource "local_file" "logo" {
      + content_base64       = "iVBORw0KGgoAAAANSUhEUgAAAMAAAADACAIAAADdvvtQAAAACXBIWXMAAAITAAACEwGa0+JEAAARaElEQVR4nO2dT2zb1h3HnWWTs46cNShDK2GYGWygL/GsWsaQZitE75Bug9W4yw61LtaAQT4NUaeuWA+DmdsOcaesPSxCgSjYIANdg6qVDk26ofQOTluEnjJnGMz1D70WVNtVqzyqf6KuyCC/5vmJpChKT3ZI5feBDxJDUv++ee/3fu/3Z9+NGzeGAKBXPgffHEADCAigAgQEUAECAqgAAQFUgIAAKkBAABUgIIAKEBBABQgIoAIEBFABAgKoAAEBVICAACpAQAAVICCAChAQQAUICKACBARQAQICqAABAVSAgAAqQEAAFSAggAoQEEAFCAigAgQEUAECAqgAAQFUgIAAKkBAABUgIIAKEBBABQgIoAIEBFABAgKoAAEBVICAACpAQAAVICCAChAQQAUICKACBARQAQICqAABAVSAgAAqQEAAFZ8fpK+vpjfKynuSXBkaGipvVGv6dXScC7HNvyDLhRghErrVb3OgGISGc6qmFyQ1V1KuKlUn5x+PcrNC88/P+nb/3Q043haQJGviWXllrdLb5fMzfCLGw5hEg1cFRCkdkuhkUFyIgIx6w3sCqumN1NLq+ZJi+a+jQSbMHwyPBcJ8gJyhts2jqqrpkqxtVurmC0/OHRaTUzCpdYvHBCTJWkKUzApAZo0QCXIhtuNNkM2UWV433Gc0yOREAYairvCSgHJF5SenJPLICONLxcdTc+O9jRyW8+Bvfn5PKj5O/WZvFzwjoIQoGaatsVH/84//wMmQY09BUhOitFVv4LPmZ/icKPT9Iwwk3nAkWho9G5s1MSvT33xW4NRi/HiUw0fOl5SEKNleBHzGflEUXf5d5IrKo0+8YvlPV5Wqn/EdGb+T8iUODO9/8L5vDA0NrcgVfGdV02cFrtOltztun8IkWZteKNmcMBpk1GK8Xy9nMLMWkxExGenXzQcSV09hNb0xm75kf47lmrxnEjH+3OKO9XMqK0uy1t8PNWC4WkAG23aPXjTGn5w7jJ/Opi/V9L1+Dx7CvQKSZO3ZFRU/HRv1W55GGr/9IpM+OsEH0M226k2/5a5+Uk/jXgGR66AJPvDrn33b8rRU/LDlcTPIDe1wSiqcPjbCfOZbOl9SYCJrh0sFlCsqpHGTSd8zK3DzM7zhtHOLTh3HCVE6dP/y9EJpeqHExfKqptufz4VY0p0onu2Dv2Agca2ANvDj6GQQqSQnCovJyGiQQYuvZ04fS8SMkrJEzMqkG2mzUs8sr3e8KjU3jgehlbUKDEKWuDGgTNV0cnuhZSToaV2dyRvlUt7oHDnkZ5v7JKdu+ipzRQW2ycy4cQTKEaPFCOOj9+aZl3ION0BSczvaPV9SYDlmxo0CKkg7iy+kHknWZtOX9k1l0R8XyydEiWZOcTiW+FkfaXiRbwxAuE5ANb1BRqbOClxClKYXSuSSfrNSP19SphdKQrJYdhDGiswmzAQfcGg8YQUjQEBmXCegsvIe+fSpF14n7d8JPhCdDEYng+jpylrl7vgFs4ljIJM+ig+MML6udtrJsQrsaDOu2wvL5NcfeuwyevzVrxz49/sfo8cjjK+wdIz8OZtBYfl1ZG53DMDY9gBV/IwvERvrNngoHL+AB8U3npujDyAZJFy3CqsRBq/+wSf4sZSNhW96hxEosyKTX0erdC7E2izQhEio5zVUmA9gAakVHQRE4j4B3UzmGhoa+rjxKXowP8Mb1INJxceFqZCQLJ7KykKk6TEqK1XpioaFyAVZh6Gu7SCvLW9UYTFP4joBWXpo7GNMw3ygsHRseqGEdj+wC3s0yHBBdtuReMXPDieaSTxdz19Igvhxbc83d12OBzJTtxMtrIcfjBAJRSeDyB5CgdKJGZ4cOVRNF7MyF8vnRKFbxxIXYhycdZviulWYea4hB4B2JEQJO6/VYlxMRgz34UJsThTEZOSBhy/litYpQUAPeEBAHcnk19FSH8Vg2Cy2U/HxCT6QWlrtyqesav2MWRswPF+dA81NaKaTzsaabh7bAWZW4LbqDXKztvNLVHa27p0Mh7cVrhOQEAl2db6YldFWVyZ91M/6EjH+2RW14wDTlU+ZXBiCPWTAfVNYN//Fa3oDSWE0yCDTGK2x+7vnQC4Mw/zBPt55AHCjDWTYurLZ7ZJkDQ0/eGGFBGTYDyHpGEpmBpvno0EGkucNuNEGMnjqtuqNdr861ha+xM/6RhifTbgPGpycm+rkYAYuRDNuFJDZT9NuEJKufLbgIn/aMB8gzV6SgqSiEcu5FEBA9rhUQDiWFGG/DT7RWskF2UaWZ+IFmkNfIraxurrqtsKly3jDT9XOKA6PBcxmzcpaxdJzrWo6Ciqan+EdmjK54gaOZnR+1W2FSwVk2FffrNQtZzE0p5BGEpKa5VCB84QcRlXX9AYZe+88Bu22wqUC4kKsIYnH0vU3K3BoybYjjqw8sh30YzizIKk7kUPbxTcKUgd3EVmBCmeGAAbcW1xB1fRD9y/jp1/+km9rJWE+raxUhWRxq95ASmpaLa1xZ+ggF8tv1RsjjE8txnPFDRyzNsEHhEhwu7pZyHDbu+MX8NMXz86AgCxx71YGF2LJHPX/ftCw3KMI8wEpG5uf4bkgG+YPStmY+ZeeTV9EpkxOFPxsS5rHVaV6Zvlaaumy4RIyL/Z41CgvAOPqcA4xOVWQVDyPPPLblywNkTAfsIlnxRv1J+cOI+kgXyWZ+ZponS5TS6tkYD8y1QFLXF1g6sDw/vBYAAfVf/jx/z746JNjR77m/A64MN7xKEeKrKxUSYlcvPxWcwC7KZS3qx+RSSA1vfHgsW8eGN7v5BVreuOla+8UJPX5y29JcgX/1fTG29UPBy8c1gM1Eskw+337hkqZ7//wO193ciFWzwQfkM7GyEV4QVIfeNhYeejcooBHOEOlKfMdDBQktSCp7WoIk0QngyiaezDE5I0im2SFzf2f23flDz+yj1Eka0lb/vY1vSEsFJs1G9KXyLzVbjVUVqqZ/Dp2cHdFdDKYiI153TvgySqtw779v3v03nZffVmpJkQJzVAd032QksjpzLmGzGWHe2A0yGTSR73r4/ZSnWhDpd/jUS6TvscwEaSWVs8sX8MJhE5+GBoNGd7SCOMTIqF2dfLLG1UcPmAgOhnMiYIXJzWPVarH+kAY4ufxjz0/w6P4Moe3pdFQamm1IKlCJIQsm46v1W7Wc654V+G9Xhm5opJaWjV8+847OKE+B9vLouvCVAhva9BoqAfQPkkmv274ICfnDpOJ2O7Hk916VE0n0zBIJvgAXpCT0bHljapa0SW5YugpFp0MStkYerzHGsIyOtVaLt1bdfI93C+sIKmppVX6Mr+kSrrS0GiQKSzdF+YDZaXaMXPNhrJSnU1fJD+IhzTk+Y6FuaKSK2700DgMla4yZ5B1paERxseFWD/jw8NYb9T0RkKUSO+lVzQ0CC0vsWWDt9xtGA0yHQ3erjSEuHElSf8pDGs68kVdy4AIiKSsNNvtSnKLktC6OswfdGi1mDX0zOljWHNmDfVru96gob/mT9BMjnvAQHVtRqBvnPLnRJv2pIDIma4592VbtmPRSh49rukNSdaQYdTtshxNW1hDCVEq50/QfJDdZgAF1C/I1I7FZIQcCSRZMwSj4QHP4GXooQtiJn0U7/VeVapiVnZzw5cBnML6AtklaDTIlPM/Ns99qBCRJFeQ8fv+i814NxS5ZjiTnP6cgKPk0LluLovm+dz4XYIsTd+uGW+YD6Ti44WlYzeuJF88O1PTr7fbVe2220aYD5CjTl/66u0SICALJFkjs1GdLIWESIgLse3y0dolBbRD1fRUfBxn6J4vKT0k1O4NICALyNhZMTnl/EI/03aJR1ZoaEdBUrlYft9U9tD9y+H4hSce+S4+0UlvhlsCCMhITW+QC+mubBdhqq2x3NGOVjX9gYcvYX/0VaX66ptbeBBybVEsEJARMomx22TCMB+YsHLbmPsMmcmZugqXlSoe/7bqDXeWOQcBGSHTqHtwJuVEwZCXPcL4nKzDcZ4/xpBA4s4y5yAgI+Tv1EN0DkozwuNQs25aNuZkEW5ZHNLP+nBLRneOQOBIbKGmN8gqwb1FazT35/MnVE2v1RvONyKESMgQ3Ijya4VIEPmZNiv1mt5wW34+jEAtkJWpKMshciG2q22sRIwnTSUcUUlmpdkUzrpVwAjUAlmQ1WZJZQ+Z4jPC+MJ8IDwWSMTGOuoJhbSqmk4m/ZB2mAvr5IOAWmjnCXTIdqP7i2RIyVa9sbJWWVmrnFm+Fp0MigsRewXYW10urJMPU1g/SS2tYvWMME37dzEZOTl3GPWnWlmrTC+UemgibukacAkwAvWNgqRiKzg6GSws3WfI7EFR9GeWrzXznbfjqQuSmisqONdnhPFt1RsTfADtsuEpDzu4m0t9l+3Mg4D6Bh5aUKy0YbnkZ5veoNTcOJrjZtMXcf3X+RmejJBEUhOSxWYzq21Tuqt9tD0GBNSCzWaWPWWlitf/7XbvkYykbAyHHZq76GGpCZHg9EJJ1XQpG8M7/D3b9bsH2EAttKyZHbQGx5B+5I7F9vGIYhNrJkRC8zP8ylrl9O//1s0n2GtAQC2Qvp+unC7k+sje7yxmZRRtOBpk7AN9kLb++KfX8ZGeB8jdAwTUAhdi8U7WZqW+G1E4qEUwytq5qlRtttlRX45X/v4uPuLCUlcgICOtbZq7TjezB4csJmI8apLXVe8pF3bqAAEZIV15zrtCtc59HRotYJmKCxGbOA2DsMz11N0ACMgIKaCVtYrDWcyQh9/uNHQ37BgUIqFmfaA20YYGIXbbCGtvAAEZ8bM+clPTYUA7F2KRu9k+cAc5fkhbGGWfWcr0qRdeI5+ai1+7ARCQBWQU/fmS4tCPh3/gjoE75DINmTXmPbia3vjHGzX8FLmne/kwuwwIyAJk3uLjqdOOdq8SMR6FMNuYNeZdrXYtEPPPv0o+Tc3ZNT6/hYCArBEXdracVtYqaO3d+aqbIcztzg+b2gKjABI/O2w485ePv4wfO0wtuiWAgKxBjmD8Tw89dtlJSDIehNpZ30gHm5U6HqIkWUMxQ+Rpmfy6/uEnO09dXLMMBNSWTPooGR4/m77kxBjCg5Cl9Y11mRCl7cpGyvmSkoq3TE+qpv/izM7wg+pK9//j9QnIjbeDzJBHe59SNtbRmBWSRbTaalfzhazhYigkVdMb33rw6TffqeNXVItxN/cpAwF1QMzKZA3DEcaXSR+1t0iw7Ca2o+stz1E1Xa3ofnaYlGNNb9z70+euvfYffMT9XYJc3SvDDQiRkKrpuFDQ9can233prx8Zv7Nd9wwuxNb06y9fe/ed6kd+xndk/E7zOX52mAuxdwXuwEeaFTkWiv/81xY+cm7RA1V/YQRyhKFwWMfCP2SBMydVxjL5dTErk5U9oEbioGHWELJw28XJq5oejl9AnfAsywvh08wliz1ULRoE1AVk3yCSdm1TcJ2odg1fzEWivVJbEwMC6g5J1hKiZFmcGtUNRt0zsVZwDWhSQ+26HbB3fOEvT97v8qqaBkBAXVPTG2L2CtmywwxqxRrmD3IhJswfTC2tPv3n12fuHb0r8EWyByPJie8devJXUc91FgcB9Ygka+JZuYcC52acJBy6FhAQFZKsIW9ybzc5HuVS8cOe7ugLAuoDzV7j2/nwZK8CGwap6yUIqM+gxnJqRW/6mm/upzY9zmMBP+MLjwUGrIM4CAigAnbjASpAQAAVICCAChAQQAUICKACBARQAQICqAABAVSAgAAqQEAAFSAggAoQEEAFCAigAgQEUAECAqgAAQFUgIAAKkBAABUgIIAKEBBABQgIoAIEBFABAgKoAAEBVICAACpAQAAVICCAChAQQAUICKACBARQAQICqAABAVSAgAAqQEAAFSAggAoQEEAFCAigAgQEUAECAqgAAQFUgIAAKkBAABUgIIAKEBBABQgIoAIEBFABAgJ6Z2ho6P8wWN6mee2KfQAAAABJRU5ErkJggg=="
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/color.png"
      + id                   = (known after apply)
    }

  # local_file.logo["outline.png"] will be created
  + resource "local_file" "logo" {
      + content_base64       = "iVBORw0KGgoAAAANSUhEUgAAACAAAAAgCAYAAABzenr0AAAACXBIWXMAAACxAAAAsQHGLUmNAAACvklEQVRYha1XsY7UMBB9rK6gIyWiufzBhZqC7WiQSEmDlPqq+wPyCeEDTqSiDn+QFT+QnmaRKCg4CEgnCiQGzfHmmDPOcrIz0mwc79h+8zyecSAiMW1EZBCRWf7KJCKdiFQLY5L0jv442QLoARwD+ABgoqqUAGoA9wC8BdAAmJErDvUpff0uIvUBbxoys1+DDWts5aZ0/xlYcksURLEGAJ3o0kHYRozDvpJMDLkAGi7a0POziGFHmz7ob9mfvBUbBtY3Blnl1Iu9h0HXcWyTHIqk8SOfDRnYs+3pbxf2e6QmMXDEY6X6ikcQfI48liXbMQbA/16mErBx7cG1lfITLqggWrbPUhc6BGDHduH6OyYbHwsT4yWUrZsjCYBluieu/4TeegC1szUpaBP23154nlU+u+CwLDfxvWCQPg8CMfsYWuONiPwSkad8rxjZFRe0QjS5RLVaIjIPLzmh99AWNyY62uj7MZ+zY6CizRhU0X4hu94oRjr4B+mvXb4P60J1AETrWGmpvqyPYS4JERUO/T4ykfB5CEQsWRUOnGfsHwA+8/UOzMx2R2aWmJCFWhKyd11Fk4OHOri4aQL6p4V9NxB9LoDKVVHfX7oAnCPj1P6c/5c5AKxEx/bc4qWNbK2JbkN3lJzB/mTA3UKBaqh90G+2O2bPKoeBmIemtTt6gwtcuJNylUVzGFgS9fw1gIf0csuSbfViInvv9SUHwI6Th1I6isHFrdJaNdVx53qb2kQmuK3oAo+DMm7i+wxkSTV5oOByAFiAhZeUkeXcFqvY17u74wsAd68uQSskotg1fnQBWvHItcwBmjV/isinNTJh4fJ7eImdXfTXTNFqf+FB5wLwHlq1MzYsHRcOxBfandr48OM0VTTodI+fcQL9sNV9vw/gAsAjfvB+pc2764VWYCBkw9+crB5orIQ1AyKC38yyWULyQOf/AAAAAElFTkSuQmCC"
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/outline.png"
      + id                   = (known after apply)
    }

  # local_file.manifest will be created
  + resource "local_file" "manifest" {
      + content              = jsonencode(
            {
              + $schema          = "https://developer.microsoft.com/en-us/json-schemas/teams/v1.5/MicrosoftTeams.schema.json"
              + accentColor      = "#1037A6"
              + bots             = [
                  + {
                      + botId              = "a08bcffb-7f2c-47c6-9990-a38613d7d575"
                      + isNotificationOnly = true
                      + scopes             = [
                          + "personal",
                          + "team",
                        ]
                      + supportsFiles      = false
                    },
                ]
              + description      = {
                  + full  = "Icebreaker ist ein niedlicher kleiner Bot, der jede Woche nach dem Zufallsprinzip Zeichensetzende zusammenbringt, um zu helfen, Vertrauen und persönliche Beziehungen aufzubauen."
                  + short = "Bringt Zeichensetzende nach dem Zufallsprinzip zusammen."
                }
              + developer        = {
                  + name          = "Zeichen gegen Mobbing"
                  + privacyUrl    = "https://zeichen-gegen-mobbing.de/datenschutz"
                  + termsOfUseUrl = "https://zeichen-gegen-mobbing.de/impressum"
                  + websiteUrl    = "https://zeichen-gegen-mobbing.de"
                }
              + icons            = {
                  + color   = "color.png"
                  + outline = "outline.png"
                }
              + id               = "a08bcffb-7f2c-47c6-9990-a38613d7d575"
              + localizationInfo = {
                  + defaultLanguageTag = "de"
                }
              + manifestVersion  = "1.5"
              + name             = {
                  + short = "Icebreaker"
                }
              + packageName      = "de.whitetom.zgm.icebreaker"
              + permissions      = [
                  + "identity",
                  + "messageTeamMembers",
                ]
              + validDomains     = [
                  + "icebreaker-pyvgcb633ehza.azurewebsites.net",
                ]
              + version          = "1.0.0"
            }
        )
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/manifest.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #36](https://github.com/WhiteTomX/microsoft-teams-apps-icebreaker/actions/runs/1644649908)